[catch {exec nproc} max_threads]

set_param general.maxThreads \$max_threads
read_verilog [ glob ./rtl/*.v ]
read_xdc $constraint_file

synth_design -part $part -top $top

write_checkpoint -force post_synth
report_utilization -file reports/synth_utilization.txt
report_timing -file reports/synth_timing.txt
